In [1]:
# pandas is package, whole package ko type datatype hunxa ;
#     pandas ma 2 type hunxa; one is "DataFrame" and other is "series" like numpy ko "array"

# data pre-processing, data analysis ko work ma panda use hunxa
# while working with file

# dataframe vaneko like a table i.e, row and column ko structure (ekai choti row and column) huna paryo 
# series vaneko chai kunai euta 1D row or 1D column ho, single row or single column

In [2]:
# ques:
# pandas ko work garda space ma either 1D or 2D huna paryo?

In [3]:
# for the 1st time when you import pandas, it says no module found

In [4]:
# !pip install pandas

In [5]:
import pandas as pd

In [ ]:
# datatype: used in small data ko type like list, array 
# data structure: used in big module name like in pandas. So, inside pandas there will be datatype
# euta structure vitra multiple datatype cha so its called datastructure

# Creating Dataframe
Two ways:
- dictionary vitra list
- list vitra list

In [6]:
# from dictionary

data = {'name': ['Alice', 'Bob', 'Charlie'], 'age': [25, 30, 35]}
df = pd.DataFrame(data)


# here "name" and "age" is column name and their respective value are 
# pd is a module and DataFrame is a class

In [7]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [8]:
data.columns

AttributeError: 'dict' object has no attribute 'columns'

In [ ]:
# error occurred because data is a dictionary and it does not have any cloumns method
# but pandas module have such method

In [9]:
df.columns

# res: returns column name

Index(['name', 'age'], dtype='object')

In [10]:
# from list of lists

data = [['Alice', 25], ['Bob', 30], ['Charlie', 35]]
# df = pd.DataFrame(data, columns = ['name', 'age'])
df = pd.DataFrame(data)

In [13]:
print(df)

         0   1
0    Alice  25
1      Bob  30
2  Charlie  35

In [14]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [15]:
# without columns name given, see the result

df.columns

RangeIndex(start=0, stop=2, step=1)

In [16]:
# start = 0; stop = 2
# column starts at 0 and stop is exclusive i.e. it returns two column

In [17]:
# case: giving column name in separate way
df.columns = ['name', 'age']

In [18]:
df.columns

Index(['name', 'age'], dtype='object')

In [19]:
# case: what if someone forgot to give a column name and wants to give it afterwards
df.columns = ['name', 'age']

In [20]:
# case: giving column name at the time of creating data or qdding aterwards 
df = pd.DataFrame(data, columns = ['name', 'age'])

In [21]:
df.columns

Index(['name', 'age'], dtype='object')

# Accessing Data

In [ ]:
# series: either a single column/row or a single value
# passing in a single list returns as series vs double list returns as Dataframe

In [22]:
df['name']

0      Alice
1        Bob
2    Charlie
Name: name, dtype: object

In [23]:
type(df['name'])

pandas.core.series.Series

In [ ]:
# dataframe slicing concept

In [26]:
df['name']
#  res: returns as a list

0      Alice
1        Bob
2    Charlie
Name: name, dtype: object

In [38]:
type(df['name'])

pandas.core.series.Series

In [27]:
df[['name']]
# res: returns series

      name
0    Alice
1      Bob
2  Charlie

In [28]:
df[['name', 'age']]
#  note: list of list garera pass garnu parxa for having title / column name

      name  age
0    Alice   25
1      Bob   30
2  Charlie   35

In [35]:
# or
list_col = ['name', 'age']
df[list_col]

# res: viewing in dataframe looks good and nice in view

      name  age
0    Alice   25
1      Bob   30
2  Charlie   35

In [37]:
type(df[list_col])

pandas.core.frame.DataFrame

# Condition Based Filtering

In [ ]:
# Ques: return whose age is greater then 30

In [49]:
df['age'] >= 30

0    False
1     True
2     True
Name: age, dtype: bool

In [50]:
df[df['age'] >= 30]

# for printing value df[condition]

      name  age
1      Bob   30
2  Charlie   35

In [58]:
df[df['name'].str.startswith('A') & (df['age'] > 25)]

Empty DataFrame
Columns: [name, age]
Index: []

In [ ]:
# res: 
#    .str => converts to string

In [59]:
df[df['name'].str.startswith('A') & (df['age'] >= 25)]

    name  age
0  Alice   25

In [79]:
# ques: return all the non-empty values in age column
df['age'].isna()

0    False
1    False
2    False
Name: age, dtype: bool

In [80]:
df[df['age'].isna()]

Empty DataFrame
Columns: [name, age]
Index: []

In [ ]:
# let's print all the value from here

In [81]:
t = df['age'].isna()

In [82]:
df[~t]

# ~: its a ngative in pandas

      name  age
0    Alice   25
1      Bob   30
2  Charlie   35

# Filtering using existing methods

In [88]:
df

      name  age
0    Alice   25
1      Bob   30
2  Charlie   35

In [87]:
df.loc[0, 'name']

# loc ma indexing row ko hunxa i.e 0, column ko indexing hunna 
# column ko indexing ko laagi iloc use garne

'Alice'

In [89]:
df.loc[0:1, ['name', 'age']]
#  euta vanda dherai column chaiyo vane list ma rakhnu paryo i.e. ['name', 'age']
# loc le 0:1 ma last ko lai pani inclusive garne vo

    name  age
0  Alice   25
1    Bob   30

In [90]:
#  or list vitra list narakhi kana ni garne milne vo

df.loc[0:1, 'name': 'age']
# loc le direct garne vo, inclusive

    name  age
0  Alice   25
1    Bob   30

In [91]:
df.iloc[0,0]
# iloc le 1st ko row ko index linxa and 2nd ko column ko index linxa

'Alice'

In [93]:
df.iloc[0 : 2, [0,1]]
# iloc le index wise kaam garne vo, last ko exclusive hune vo
#  0 : 2 ma 2 exclusive vo, i.e. 0 to 1 samma result dinxa

    name  age
0  Alice   25
1    Bob   30

In [97]:
#  or
df.iloc[0 : 2, 0:2]
# column ko index chai feri inclusive cha

    name  age
0  Alice   25
1    Bob   30

In [ ]:
#  to grab a single cell 
#  use .at method
# its fast than loc and iloc if you want only specific cell

In [98]:
df.at[0, 'name']

'Alice'

In [99]:
df.at[0, 'age']

25

In [101]:
df.iat[0, 0]

'Alice'

In [104]:
df.iat[0, 1]

25

# Reading and writing data

In [109]:
# csv => comma seperated value, perket file 
# tsv => tab separated value

In [ ]:
# . => current path
# ./ => current directory path
#  ../ => out of current directory path

In [ ]:
# way to work with csv, excel, and sql file

In [110]:
df = pd.read_csv('./../data.csv')

In [111]:
df

    name  age
0  Alice   25
1    Bob   30

In [112]:
# adding new data in our existing csv file

df.loc[2, 'name'] = 'Charlie'
df.loc[2, 'age'] = 34

In [113]:
df

      name   age
0    Alice  25.0
1      Bob  30.0
2  Charlie  34.0

In [114]:
# saving new data
df.to_csv('./../data.csv')

# for the result: see in the csv file, you will also get index value there

In [115]:
# if don't want to put index number in csv file
df.to_csv('./../data.csv', index = False)

## Data Exploration

In [135]:
# df.tail()
# df.tail(2)

# df.info()

# df.describe()

# df.value_counts()

# df['age'].nunique()

# df.shape

# df.isnull()

# # isnull and isna() are same

# df.isnull().sum()

In [116]:
df.head()

# by default head() returns 5 rows

      name   age
0    Alice  25.0
1      Bob  30.0
2  Charlie  34.0

In [121]:
#  number of rows you want
# it displayes rows starting from top

df.head(2)

    name   age
0  Alice  25.0
1    Bob  30.0

In [124]:

df.tail()

# shows last row data
# it displayes rows starting from bottom

      name   age
0    Alice  25.0
1      Bob  30.0
2  Charlie  34.0

In [125]:
df.tail(2)

      name   age
1      Bob  30.0
2  Charlie  34.0

In [123]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      float64
dtypes: float64(1), object(1)
memory usage: 176.0+ bytes

In [ ]:
# object ma by default convert gardinxa

In [126]:
df.describe()

# only gives the result of number type

             age
count   3.000000
mean   29.666667
std     4.509250
min    25.000000
25%    27.500000
50%    30.000000
75%    32.000000
max    34.000000

In [127]:
df.value_counts()

name     age
Alice    25.0    1
Bob      30.0    1
Charlie  34.0    1
Name: count, dtype: int64

In [128]:
df['age'].nunique()

3

In [129]:
df.shape

(3, 2)

In [131]:
df.isnull()
# isnull and isna() are same

    name    age
0  False  False
1  False  False
2  False  False

In [133]:
# to check number of missing data at once in large dataset
df.isnull().sum()

name    0
age     0
dtype: int64